app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'imammaulana'
 LIMIT 1
---
    public function authenticate()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        if (empty($username) || empty($password)) {
            return redirect()->back()->with('error', 'Username dan Password tidak boleh kosong.');
        }

        $userModel = new UserModel();

        // Ambil data pengguna dari database
        $user = $userModel->where('username', $username)->first();