app/Controllers/Home.php

INSERT INTO `users` (`username`, `password`, `email`, `nama_lengkap`, `no_hp`, `alamat_lengkap`, `kota`, `provinsi`, `kode_pos`, `negara`, `role`, `dibuat_pada`, `diperbarui_pada`) VALUES ('imammaulana', '$2y$10$DNdhPvGlp4lrgE3mbniTfOcGuAjd3W/9dBa4aEmQ3UggtOgZAfoDq', 'imammaulana@gmail.com', 'Imam Maulana', '085727275037', 'Poncol Gg.matana permai', 'Kota Pekalongan', 'Jawa Tengah', '51122', 'Indonesia', 'pelanggan', '2025-01-12 07:51:41', '2025-01-12 07:51:41')
---
            'role' => 'pelanggan',
        ];

        $this->userModel->save($data);