app/Models/CartModel.php

SELECT `cart`.*, `users`.`nama_lengkap` AS `nama_user`, `kategori`.`nm_kategori`, `product`.`nama_product`, `product`.`diskon`, `product`.`gambar_1`, `product`.`harga`
FROM `cart`
JOIN `users` ON `users`.`id_user` = `cart`.`id_user`
JOIN `kategori` ON `kategori`.`id_kategori` = `cart`.`id_kategori`
JOIN `product` ON `product`.`id_product` = `cart`.`id_product`
WHERE `cart`.`id_user` = 'NA20241212'
---
    public function getCartDetails($userId = null)
    {
        $builder = $this->db->table($this->table)
            ->select('cart.*, users.nama_lengkap AS nama_user, kategori.nm_kategori, product.nama_product, product.diskon, product.gambar_1, product.harga')
            ->join('users', 'users.id_user = cart.id_user')
            ->join('kategori', 'kategori.id_kategori = cart.id_kategori')
            ->join('product', 'product.id_product = cart.id_product');

        if ($userId) {
            $builder->where('cart.id_user', $userId);
        }

        return $builder->get()->getResultArray();