app/Models/ProductModel.php

SELECT `product`.*, `kategori`.`nm_kategori`
FROM `product`
JOIN `kategori` ON `kategori`.`id_kategori` = `product`.`id_kategori`
WHERE `product`.`status` = 'Aktif'
AND `kategori`.`nm_kategori` = 'makeup'
---
    public function getProductsByCategory($category = null)
    {
        $query = $this->join('kategori', 'kategori.id_kategori = product.id_kategori')
                    ->select('product.*, kategori.nm_kategori')  // Pilih kolom dari tabel produk dan kategori
                    ->where('product.status', 'Aktif');  // Filter berdasarkan status "Aktif"

        if ($category) {
            $query = $query->where('kategori.nm_kategori', $category);  // Filter berdasarkan kategori jika ada
        }

        return $query->findAll();